# 1. 딕셔너리 사용

In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name':'John', 'age': 25, 'job':'student'},
    {'name':'Nate', 'age': 35, 'job':'teacher'}
]

In [3]:
df = pd.DataFrame(friend_dict_list)
df

   age      job  name
0   25  student  John
1   35  teacher  Nate

+ 딕셔너리로 데이터프레임을 만들면 칼럼이 알파벳 순으로 정렬되어 나와서 원래 순서로 정렬하고 싶으면 추가 작업이 필요

In [5]:
df = df[['name', 'age', 'job']]
df

   name  age      job
0  John   25  student
1  Nate   35  teacher

+ ordered dictionary를 사용하면 추가 작업을 해주지 않아도 됨

In [7]:
from collections import OrderedDict

In [8]:
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

In [10]:
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [11]:
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

# 2. 리스트 사용

In [13]:
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [14]:
column_name = ['name', 'age', 'job']

In [15]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [16]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [17]:
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['name', ['student', 'teacher']]
]

In [18]:
df = pd.DataFrame.from_items(friend_list)

In [19]:
df.head()

   name  age     name
0  John   20  student
1  Nate   30  teacher